{
    "experience": [
        {
            "companyName": "SOFTIC",
            "location": "Dhaka, Bangladesh",
            "website": "https://softic.ai",
            "roles": [
                {
                    "title": "Software Engineer",
                    "year": "Jan 2023 - Present",
                    "tasks": [
                        "Engineered a real‑time chat support application using Express.js, SocketIO, and MongoDB, enabling seamless user communication and improving platform engagement.",
                        "Developed and maintained a secure transaction system supporting deposits, withdrawals, and account transfers across multiple currencies, ensuring data integrity and compliance with financial standards.",
                        "Built a multi‑currency rate management service, integrating real‑time exchange rate updates and ensuring accurate financial calculations across transactions.",
                        "Designed and deployed a notification service using GraphQL subscriptions, providing instant updates across all user activities and system events.",
                        "Implemented an authentication and authorization service with role‑based access control, securing endpoints and sensitive user data.",
                        "Architected and optimized a wallet service using PostgreSQL and Prisma, ensuring accurate balance tracking and transaction histories.",
                        "Collaborated closely with product and design teams on SRS preparation, database design, and backend system architecture for solutions.",
                        "Utilized NestJS, PostgreSQL, MongoDB, Kafka, and Redis to develop and optimize scalable backend services."
                    ]
                }
            ]
        },
        {
            "companyName": "Oxford International School",
            "location": "Dhaka, Bangladesh",
            "website": "https://ois.edu.bd",
            "roles": [
                {
                    "title": "Software Engineer",
                    "year": "May 2022 - Nov 2022",
                    "tasks": [
                        "Developed and maintained core backend services for a comprehensive school management system, covering employees, teachers, guardians, and student data management.",
                        "Built and optimized the material distribution module, enabling teachers to upload and share class materials with students securely and guardians.",
                        "Developed the result generation system, allowing teachers to input marks, calculate grades, and generate student result reports using EJS for formatted PDF reports.",
                        "Implemented key features using Express.js, MySQL, and Prisma, ensuring efficient data storage, retrieval, and processing.",
                        "Collaborated with cross‑functional teams to gather requirements and ensure seamless integration between backend services and frontend interfaces."
                    ]
                }
            ]
        },
        {
            "companyName": "OPLLY",
            "location": "Dhaka, Bangladesh",
            "website": "https://opply.com",
            "roles": [
                {
                    "title": "Frontend Developer",
                    "year": "Dec 2022 - Apr 2023",
                    "tasks": [
                        "Collaborated as a mobile developer on a team building a NativeScript Vue mobile app, enabling users to request personalized video messages from their favorite celebrities, with features for celebrities to record and upload videos for users."
                    ]
                }
            ]
        },
        {
            "companyName": "INTIGSOL",
            "location": "Dhaka, Bangladesh",
            "website": "https://www.linkedin.com/company/intigsol",
            "roles": [
                {
                    "title": "Software Developer & Software Developer (Trainee)",
                    "year": "July 2021 ‑ April 2022",
                    "tasks": [
                        "Worked on developing an e‑commerce platform utilizing React.js for the front end, Express for the back end, MySQL for database management, and Prisma for seamless database integration.",
                        "Designed and developed static websites using HTML, CSS, JavaScript, and Reactjs, ensuring responsive layouts and optimal user experiences across devices.",
                        "Created user‑friendly and visually appealing UI designs using WordPress Elementor, customizing templates to meet client specifications and enhancing overall website functionality."
                    ]
                }
            ]
        },
        {
            "companyName": "M/S KACCHI KHOR",
            "location": "Farmgate, Dhaka, Bangladesh",
            "roles": [
                {
                    "title": "Founder",
                    "year": "Oct 2019 - Dec 2020",
                    "tasks": [
                        "Led and managed restaurant operations, overseeing kitchen, market procurement, and overall restaurant management.",
                        "Directed marketing efforts, including online promotion and social media strategies to boost customer engagement and sales.",
                        "Coordinated and managed teams, ensuring smooth daily operations and delivering high‑quality customer service."
                    ]
                }
            ]
        }
    ]
}